In [1]:
import pandas as pd

## load JSON

In [2]:
df = pd.read_json(
    "../data/auto.json",
)
df = df.set_index("CarNumber", copy=False)

## make selects

In [3]:
df.loc[df['Fines'] > 2100]

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
E432XX77RUS        1   6500.000000      Toyota    Camry
92918M178RUS       1   5700.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
E40577152RUS       1   8594.586466        Ford    Focus
...              ...           ...         ...      ...
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
O22097197RUS       1  24300.000000        Ford    Focus
M0309X197RUS       1  22300.000000        Ford    Focus
H419XE197RUS       2   8594.586466      Toyota  Corolla

[455 rows x 4 columns]

In [4]:
df.loc[(df['Fines'] > 2100) & (df['Refund'] == 2)]

              Refund         Fines        Make    Model
CarNumber
Y163O8161RUS       2   3200.000000        Ford    Focus
H234YH197RUS       2   6000.000000        Ford    Focus
707987163RUS       2   2200.000000        Ford    Focus
K330T8197RUS       2   8200.000000       Skoda  Octavia
M592CH197RUS       2   8594.586466       Skoda  Octavia
...              ...           ...         ...      ...
O136HO197RUS       2   7800.000000      Toyota  Corolla
O68897197RUS       2  12300.000000        Ford    Focus
O718MM163RUS       2   8594.586466        Ford    Focus
7065C8197RUS       2  11400.000000  Volkswagen   Passat
H419XE197RUS       2   8594.586466      Toyota  Corolla

[309 rows x 4 columns]

In [5]:
df.loc[df['Model'].isin(['Focus','Corolla'])]

              Refund         Fines    Make    Model
CarNumber
Y163O8161RUS       2   3200.000000    Ford    Focus
7184TT36RUS        1   2100.000000    Ford    Focus
X582HE161RUS       2   2000.000000    Ford    Focus
92918M178RUS       1   5700.000000    Ford    Focus
H234YH197RUS       2   6000.000000    Ford    Focus
...              ...           ...     ...      ...
Y163O8161RUS       2   1600.000000    Ford    Focus
M0309X197RUS       1  22300.000000    Ford    Focus
O673E8197RUS       2    600.000000    Ford    Focus
8610T8154RUS       1   2000.000000    Ford    Focus
H419XE197RUS       2   8594.586466  Toyota  Corolla

[593 rows x 4 columns]

In [6]:
df.iloc[df.index.isin(['Y7689C197RUS','92928M178RUS','7788KT197RUS','H115YO163RUS','X758HY197RUS'])]

              Refund          Fines  Make  Model
CarNumber
92928M178RUS       1    8594.586466  Ford  Focus
H115YO163RUS       1    2200.000000  Ford  Focus
7788KT197RUS       2   12000.000000  Ford  Focus
X758HY197RUS       2   24200.000000  Ford  Focus
X758HY197RUS       2   72600.000000  Ford  Focus
Y7689C197RUS       1   27000.000000  Ford  Focus
92928M178RUS       1     600.000000  Ford  Focus
H115YO163RUS       1    8594.586466  Ford  Focus
H115YO163RUS       2    1100.000000  Ford  Focus
7788KT197RUS       2    8594.586466  Ford  Focus
7788KT197RUS       1   20000.000000  Ford  Focus
X758HY197RUS       2  145200.000000  Ford  Focus
92928M178RUS       1    1200.000000  Ford  Focus
Y7689C197RUS       2    9000.000000  Ford  Focus
Y7689C197RUS       2   45000.000000  Ford  Focus
7788KT197RUS       2    4000.000000  Ford  Focus
Y7689C197RUS       1   36000.000000  Ford  Focus
92928M178RUS       2    3000.000000  Ford  Focus

## aggregations with the make and the model

In [7]:
df.groupby('Make').agg({'Fines' : 'median'})

             Fines
Make
Audi        4200.0
BMW         6500.0
Ford        3500.0
Skoda       3250.0
Toyota      7700.0
Volkswagen  4300.0
Volvo       8500.0

In [8]:
df.groupby(['Make', 'Model']).agg({'Fines' : 'median'})

                        Fines
Make       Model
Audi       Audi        4200.0
BMW        BMW         6500.0
Ford       Focus       3500.0
           Mondeo      7650.0
Skoda      Octavia     3250.0
Toyota     Camry       7700.0
           Corolla     7700.0
Volkswagen Golf        4800.0
           Jetta       2800.0
           Passat      3500.0
           Touareg     5800.0
           Volkswagen  7400.0
Volvo      Volvo       8500.0

In [9]:
df.groupby(['Make', 'Model']).agg({'Fines' : 'count'})

                       Fines
Make       Model
Audi       Audi            1
BMW        BMW             3
Ford       Focus         575
           Mondeo          6
Skoda      Octavia        48
Toyota     Camry          16
           Corolla        18
Volkswagen Golf           20
           Jetta           6
           Passat         22
           Touareg         5
           Volkswagen      3
Volvo      Volvo           2

In [10]:
pd.set_option("display.precision", 1)
df.groupby(['Make', 'Model']).agg({'Fines' : ['min', 'max']})

                        Fines
                          min       max
Make       Model
Audi       Audi        4200.0    4200.0
BMW        BMW         3000.0    8594.6
Ford       Focus        100.0  180000.0
           Mondeo      1100.0   46200.0
Skoda      Octavia      300.0  145000.0
Toyota     Camry        500.0   22400.0
           Corolla      900.0   34300.0
Volkswagen Golf         200.0  168000.0
           Jetta        500.0   46000.0
           Passat       100.0   29700.0
           Touareg      500.0    8594.6
           Volkswagen  1300.0    7900.0
Volvo      Volvo       6800.0   10200.0

In [11]:
df.groupby(['Make', 'Model']).agg({'Fines' : 'std'})

                         Fines
Make       Model
Audi       Audi            NaN
BMW        BMW          2826.6
Ford       Focus       15041.3
           Mondeo      18987.3
Skoda      Octavia     24339.7
Toyota     Camry        6410.3
           Corolla      9629.3
Volkswagen Golf        36950.8
           Jetta       17743.0
           Passat       6969.7
           Touareg      3461.8
           Volkswagen   3674.7
Volvo      Volvo        2404.2

## aggregations with car number

In [12]:
nums = df.groupby(['CarNumber']).agg({'Fines' : 'count'})
nums.sort_values('Fines', ascending=False)

              Fines
CarNumber
Y7689C197RUS      4
92928M178RUS      4
7788KT197RUS      4
H115YO163RUS      3
X758HY197RUS      3
...             ...
E42577152RUS      1
E42377152RUS      1
E41977152RUS      1
E41577152RUS      1
H917TC36RUS       1

[531 rows x 1 columns]

In [13]:
df.iloc[df.index == "Y7689C197RUS"]

              Refund    Fines  Make  Model
CarNumber
Y7689C197RUS       1  27000.0  Ford  Focus
Y7689C197RUS       2   9000.0  Ford  Focus
Y7689C197RUS       2  45000.0  Ford  Focus
Y7689C197RUS       1  36000.0  Ford  Focus

In [14]:
nums = df.groupby(['CarNumber']).agg({'Fines' : 'sum'})
nums.sort_values('Fines', ascending=False)

                 Fines
CarNumber
X758HY197RUS  242000.0
9020YC197RUS  217500.0
M0279X197RUS  216000.0
Y352O8197RUS  207200.0
Y778EE197RUS  192000.0
...                ...
83218C154RUS     100.0
Y195O8161RUS     100.0
K376HE161RUS     100.0
705787163RUS     100.0
K326T8197RUS     100.0

[531 rows x 1 columns]

In [15]:
df.iloc[df.index == "X758HY197RUS"]

              Refund     Fines  Make  Model
CarNumber
X758HY197RUS       2   24200.0  Ford  Focus
X758HY197RUS       2   72600.0  Ford  Focus
X758HY197RUS       2  145200.0  Ford  Focus

In [16]:
a_df=df.reset_index().drop_duplicates(['CarNumber','Model'])
ids = a_df["CarNumber"]
a_df[ids.isin(ids[ids.duplicated()])].set_index("CarNumber", copy=False)

              Refund   Fines        Make       Model
CarNumber
E316EH197RUS       1  1300.0  Volkswagen  Volkswagen
E316EH197RUS       1  1300.0  Volkswagen     Touareg